/****************************************************************************/
/*                                                                          */
/*                                                                          */
/*  COPYRIGHT (C) Japan Cash Machine Co.,Ltd. 2010                          */
/*  ALL RIGHTS RESERVED                                                     */
/*                                                                          */
/****************************************************************************/
/*                                                                          */
/* This software contains proprietary, trade secret information and is      */
/* the property of Japan Cash Machine. This software and the information    */
/* contained therein may not be disclosed, used, transferred or             */
/* copied in whole or in part without the express, prior written            */
/* consent of Japan Cash Machine.                                           */
/*                                                                          */
/****************************************************************************/
/****************************************************************************/
/*                                                                          */
/* 本ソフトウェアに含まれるソースコードには日本金銭機械株式会社固有の       */
/* 企業機密情報含んでいます。                                               */
/* 秘密保持契約無しにソフトウェアとそこに含まれる情報の全体もしくは一部を   */
/* 公開も複製も行いません。                                                 */
/*                                                                          */
/****************************************************************************/
/****************************************************************************/
/**
 * @file int_system_timer.c
 * @brief
 * @date 2018.01.05 Created.
 */
/****************************************************************************/
#include "systemdef.h"

#define EXT
#include "com_ram.c"

#define EXTERN extern
#include "hal_led.h"
#include "int_led_timer.h"
#include "hal_gpio_reg.h"

/**** VARIABLE DEFINES ******************************************************/
u32 _ir_led_timer_tick_count = 0;


/****************************************************************/
/**
 * @brief システムタイマ処理(1ms)
 */
/****************************************************************/
void _intr_led_timer_proc(void)
{
}

/****************************************************************/
/**
 * @brief 通常ＬＥＤ表示シーケンス
 */
/****************************************************************/
void _cyc_led_ctrl_seq1_proc(void)
{
}

/****************************************************************/
/**
 * @brief 書き込み中シーケンス
 */
/****************************************************************/
void _cyc_led_ctrl_seq2_proc(void)
{
}


/* End of File */

