/******************************************************************************/
/*! @addtogroup Group2
    @file       id003_authentication.c
    @brief      id003 authentication process
    @date       2013/10/25
    @author     Development Dept at Tokyo
    @par        Revision
    $Id$
    @par        Copyright (C)
    2012-2013 Japan CashMachine Co, Limited. All rights reserved.
*******************************************************************************
    @par        History
    - 2013/10/25 Development Dept at Tokyo
      -# Initial Version
******************************************************************************/
#include <string.h>
#include "kernel.h"
#include "kernel_inc.h"
#include "common.h"
#include "operation.h"
#include "sub_functions.h"
#include "hal.h"
#include "crc.h"
#include "user/icb/icb.h"
#include "id003_authentication.h"

#define EXT
#include "com_ram.c"
/************************** PRIVATE VARIABLES *************************/
extern void  fill_memo( u8 data, u8 *ptr, u32 size);

/************************** PRIVATE FUNCTIONS *************************/
static int	Astep0(T_Authentication	*authentication);
static int	Astep1(T_Authentication	*authentication, u8 *key);
static int	Astep2(T_Authentication	*authentication, u8 *number_key);
static int	Astep3(T_Authentication	*authentication);
static int	Astep4(T_Authentication	*authentication, u8 *number_key);
static int	Astep5(T_Authentication	*authentication);
static int	Astep6(T_Authentication	*authentication,u8 *generationValue);


/*******************************************************************************************
* ﾓｼﾞｭｰﾙ概要	:	Authenticationメイン処理
*-------------------------------------------------------------------------------------------
* 宣言			:	void	Authentication_main(void)
*-------------------------------------------------------------------------------------------
* 機能			:
*-------------------------------------------------------------------------------------------
* 引数			:	なし
*-------------------------------------------------------------------------------------------
* 戻り値       	:	なし
*-------------------------------------------------------------------------------------------
* 注意事項		:
*******************************************************************************************/
void	Authentication_main(void)
{
    T_Authentication	authentication;
	int	result;
	u8	step = 0;

	for(step = 0; step < 7;	step++)
	{
		switch(step)
		{
		/* ワークエリアの初期化を行う */
		case	0:
				result = Astep0(&authentication);
				break;
		/* 1回目の初期値(Seed Value)の決定 */
		case	1:
				result = Astep1(&authentication, (u8 *)&ex_Authentication.customerKEY[0]);
				break;
		/* 1回目のCRCの計算 */
		case	2:
				result = Astep2(&authentication, (u8 *)&ex_Authentication.numberKEY[0]);
				break;
		/* 2回目の初期値(Seed Value)の決定 */
		case	3:
				result = Astep3(&authentication);
				break;
		/* 2回目のCRCの計算 */
		case	4:
				result = Astep4(&authentication, (u8 *)&ex_Authentication.numberKEY[0]);
				break;
		/* CRC3 Valueの決定 */
		case	5:
				result = Astep5(&authentication);
				break;
		/* Authentication Codeの確定 */
		case	6:
				result = Astep6(&authentication, (u8 *)&ex_Authentication.code[0]);
				break;
		default:
				break;
		}

		if(result != TRUE)
		{
			break;
		}
	}
}


/*******************************************************************************************
* ﾓｼﾞｭｰﾙ概要	:	Authentication step0 処理
*-------------------------------------------------------------------------------------------
* 宣言			:	void	Astep0(void)
*-------------------------------------------------------------------------------------------
* 機能			:	ワークエリアの初期化を行う
*-------------------------------------------------------------------------------------------
* 引数			:	なし
*-------------------------------------------------------------------------------------------
* 戻り値       	:	なし
*-------------------------------------------------------------------------------------------
* 注意事項		:
*******************************************************************************************/
static int	Astep0(T_Authentication *authentication)
{
	u16 sum;
	u8* ptr;
	int i;

	ptr = (u8 *)&ex_Authentication;
	sum = 0;
	for (i = 0; i < sizeof(ex_Authentication); i ++)
	{
		sum += (u8)*(u8 *)(ptr + i);
	}
	/*< check SUM >*/
	sum = sum ^ 0x5555;
	/* EEPROMから読込み */
	if(ex_authentication_sum == sum)
	{
		/*	設定情報の確認	*/
		if(ex_Authentication.functionStatus != NORMAL_SETTING_AUTHENTICATION_NUMBER)
		{
			/*	異常値の設定	*/
			ex_Authentication.functionStatus = ILLIGAL_SET_AUTHENTICATION_NUMBER;	/*	*/
		}
	}
	else
	{
		/*	未設定	*/
		ex_Authentication.functionStatus = NOT_SET_AUTHENTICATION_NUMBER;	/*	*/
	}
	/*	*/
	if(ex_Authentication.functionStatus == NORMAL_SETTING_AUTHENTICATION_NUMBER)
	{
		/* ワークエリアを初期化 */
		fill_memo(0, (u8 *)authentication, 14);		/* Software Infoの初期化	*/
		return(TRUE);
	}
	else
	{
		return(FALSE);
	}
}


/*******************************************************************************************
* ﾓｼﾞｭｰﾙ概要	:	Authentication step1 処理
*-------------------------------------------------------------------------------------------
* 宣言			:	void	Astep1(void)
*-------------------------------------------------------------------------------------------
* 機能			:	1回目の初期値(Seed Value)を決定する
*-------------------------------------------------------------------------------------------
* 引数			:	なし
*-------------------------------------------------------------------------------------------
* 戻り値       	:	なし
*-------------------------------------------------------------------------------------------
* 注意事項		:
*******************************************************************************************/
static int	Astep1(T_Authentication	*authentication, u8 *customer_key)
{
	/* Seed Value1を設定 */
	SEED1_VA2 = *customer_key;			/* (H)	*/
	SEED1_VA1 = *(customer_key + 1);	/* (L)	*/

	/* Seed Value2を設定 */
	SEED2_VA2 = *(customer_key + 2);	/* (H)	*/
	SEED2_VA1 = *(customer_key + 3);	/* (L)	*/
	/*	*/
	return(TRUE);
}


/*******************************************************************************************
* ﾓｼﾞｭｰﾙ概要	:	Authentication step2 処理
*-------------------------------------------------------------------------------------------
* 宣言			:	void	Astep2(void)
*-------------------------------------------------------------------------------------------
* 機能			:	1回目のCRCの計算
*-------------------------------------------------------------------------------------------
* 引数			:	なし
*-------------------------------------------------------------------------------------------
* 戻り値       	:	なし
*-------------------------------------------------------------------------------------------
* 注意事項		:
*******************************************************************************************/
static int	Astep2(T_Authentication	*authentication, u8 *number_key)
{
	/* 計算のためにSeed Valueを設定 */
	CRC_VA = ((u16)SEED1_VA1 << 8) | (u16)SEED1_VA2;	/*	SEED1_VA1(H) | SEED1_VA2(L)	*/

	/* Number key(8 byte)分のCRCを計算 */
	CRC_VA = _calc_crc_initial_value( number_key
					, AUTHENTICATION_NUMBER_KEY_SIZE
					, CRC_VA
					);

	/* CRC Value1を保存 */
	CRC1_VA2 = (u8)(CRC_VA >> 8);		/* (H)	*/
	CRC1_VA1 = (u8)(CRC_VA & 0xff);		/* (L)	*/
	/*	*/
	return(TRUE);
}


/*******************************************************************************************
* ﾓｼﾞｭｰﾙ概要	:	Authentication step3 処理
*-------------------------------------------------------------------------------------------
* 宣言			:	void	Astep3(void)
*-------------------------------------------------------------------------------------------
* 機能			:	2回目の初期値(Seed Value)を決定する
*-------------------------------------------------------------------------------------------
* 引数			:	なし
*-------------------------------------------------------------------------------------------
* 戻り値       	:	なし
*-------------------------------------------------------------------------------------------
* 注意事項		:
*******************************************************************************************/
static int	Astep3(T_Authentication	*authentication)
{
	SEED3_VA1 = (u8)(CRC_VA >> 8) ^ SEED2_VA2;		/* (H)	*/
	SEED3_VA2 = (u8)(CRC_VA & 0xff) ^ SEED2_VA1;	/* (L)	*/
	/*	*/
	return(TRUE);
}


/*******************************************************************************************
* ﾓｼﾞｭｰﾙ概要	:	Authentication step4 処理
*-------------------------------------------------------------------------------------------
* 宣言			:	void	Astep4(void)
*-------------------------------------------------------------------------------------------
* 機能			:	2回目のCRCの計算
*-------------------------------------------------------------------------------------------
* 引数			:	なし
*-------------------------------------------------------------------------------------------
* 戻り値       	:	なし
*-------------------------------------------------------------------------------------------
* 注意事項		:
*******************************************************************************************/
static int	Astep4(T_Authentication	*authentication, u8 *number_key)
{
	/* 計算のためにSeed Valueを設定 */
	CRC_VA = ((u16)SEED3_VA2 << 8) | (u16)SEED3_VA1;	/*	SEED3_VA1(H) | SEED3_VA2(L)	*/

	/* Number key(8 byte)分のCRCを計算 */
	CRC_VA = _calc_crc_initial_value( number_key
					, AUTHENTICATION_NUMBER_KEY_SIZE
					, CRC_VA
					);

	/* CRC Value2を保存 */
	CRC2_VA2 = (u8)(CRC_VA >> 8);		/* (H)	*/
	CRC2_VA1 = (u8)(CRC_VA & 0xff);		/* (L)	*/
	/*	*/
	return(TRUE);
}


/*******************************************************************************************
* ﾓｼﾞｭｰﾙ概要	:	Authentication step5 処理
*-------------------------------------------------------------------------------------------
-* 宣言			:	void	Astep5(void)
*-------------------------------------------------------------------------------------------
* 機能			:	CRC Vaule3の決定
*-------------------------------------------------------------------------------------------
* 引数			:	なし
*-------------------------------------------------------------------------------------------
* 戻り値       	:	なし
*-------------------------------------------------------------------------------------------
* 注意事項		:
*******************************************************************************************/
static int	Astep5(T_Authentication	*authentication)
{
	CRC3_VA2 = CRC1_VA2 ^ CRC2_VA2;		/* (H)	*/
	CRC3_VA1 = CRC1_VA1 ^ CRC2_VA1;		/* (L)	*/
	/*	*/
	return(TRUE);
}


/*******************************************************************************************
* ﾓｼﾞｭｰﾙ概要	:	Authentication step6 処理
*-------------------------------------------------------------------------------------------
* 宣言			:	void	Astep6(void)
*-------------------------------------------------------------------------------------------
* 機能			:	Authentication Codeの決定
*-------------------------------------------------------------------------------------------
* 引数			:	なし
*-------------------------------------------------------------------------------------------
* 戻り値       	:	なし
*-------------------------------------------------------------------------------------------
* 注意事項		:
*******************************************************************************************/
static int	Astep6(T_Authentication	*authentication, u8 *generationValue)
{
	*generationValue = CRC2_VA1;
	*(generationValue + 1) = CRC2_VA2;
	*(generationValue + 2) = CRC3_VA1;
	*(generationValue + 3) = CRC3_VA2;
	/*	*/
	return(TRUE);
}


/* EOF */
