/****************************************************************************/
/*                                                                          */
/*                                                                          */
/*  COPYRIGHT (C) Japan Cash Machine Co.,Ltd. 2010                          */
/*  ALL RIGHTS RESERVED                                                     */
/*                                                                          */
/****************************************************************************/
/*                                                                          */
/* This software contains proprietary, trade secret information and is      */
/* the property of Japan Cash Machine. This software and the information    */
/* contained therein may not be disclosed, used, transferred or             */
/* copied in whole or in part without the express, prior written            */
/* consent of Japan Cash Machine.                                           */
/*                                                                          */
/****************************************************************************/
/****************************************************************************/
/*                                                                          */
/* 本ソフトウェアに含まれるソースコードには日本金銭機械株式会社固有の       */
/* 企業機密情報含んでいます。                                               */
/* 秘密保持契約無しにソフトウェアとそこに含まれる情報の全体もしくは一部を   */
/* 公開も複製も行いません。                                                 */
/*                                                                          */
/****************************************************************************/
/****************************************************************************/
/**
 * @file int_ihr_proc.c
 * @brief ハードウェア割り込みの関数を格納しています。
 * @date 2018.01.05
 */
/****************************************************************************/
#include "systemdef.h"
#include "kernel_config.h"
#include "isr_entry_proc.h"

/****************************************************************/
/**
 * @brief IRQ2ハードウェア割り込み関数（DOCシリアル通信完了）
 */
/****************************************************************/
void isr_irq2_proc(void)
{
	//dac_complete(); /* DACシリアル通信完了 */
}

/****************************************************************/
/**
 * @brief IRQ4ハードウェア割り込み関数（CISシリアル通信完了）
 */
/****************************************************************/
void isr_irq4_proc(void)
{
	//_intr_cis_serial_complete_proc(); /* CISシリアル通信完了 */
}

/****************************************************************/
/**
 * @brief IRQ5ハードウェア割り込み関数（UVセンサー採取完了）
 */
/****************************************************************/
void isr_irq5_proc(void)
{
	//_intr_uv_sca_complete_proc(); /* UVセンサー採取完了 */
}

/****************************************************************/
/**
 * @brief IRQ8ハードウェア割り込み関数（CISスキャン完了）
 */
/****************************************************************/
void isr_irq8_proc(void)
{
	//_intr_cis_scan_complete_proc(); /* CISスキャン完了 */
}

/****************************************************************/
/**
 * @brief IRQ10ハードウェア割り込み関数（磁気センサスキャン完了）
 */
/****************************************************************/
void isr_irq10_proc(void)
{
	//_intr_mag_scan_complete_proc();				/* 磁気センサスキャン完了 */
}

/****************************************************************/
/**
 * @brief IRQ13ハードウェア割り込み関数（データスキャン異常）
 */
/****************************************************************/
void isr_irq13_proc()
{
	//_intr_scan_abort_proc();					/* データスキャン異常 */
}

/****************************************************************/
/**
 * @brief IRQ15ハードウェア割り込み関数（採取番号確定）
 */
/****************************************************************/
void isr_irq15_proc(void)
{
	//_intr_ps0_note_detected_proc();		// 紙幣先端検知処理を採取番号確定時に移動, 18/07/26
}

//ENC_DN0=(札間タイムアウト)
void isr_irq20_proc(void)
{
}

//ENC_DN1=0
void isr_irq21_proc(void)
{
}

//ENC_DN2=0
void isr_irq22_proc(void)
{
}

//ENC_DN3=0
void isr_irq23_proc(void)
{
}

//RFID-UART 送信完了
void isr_irq24_proc(void)
{
}

//RFID-UART 受信割込み
void isr_irq25_proc(void)
{
}

/****************************************************************/
/**
 * @brief IRQ31ハードウェア割り込み関数（データ採取異常-SDRAM転送指示無効）
 */
/****************************************************************/
void isr_irq31_proc()
{
}

/****************************************************************/
/**
 * @brief IRQ32ハードウェア割り込み関数（搬送モーターパラメーターセット切り替わり）
 */
/****************************************************************/
void isr_irq32_proc()
{
}

/****************************************************************/
/**
 * @brief IRQ33ハードウェア割り込み関数（収納モーターパラメーターセット切り替わり）
 */
/****************************************************************/
void isr_irq33_proc()
{
}

/****************************************************************/
/**
 * @brief IRQ34ハードウェア割り込み関数（予約(PBモーターパラメーターセット切り替わり)）
 */
/****************************************************************/
void isr_irq34_proc()
{
}

/****************************************************************/
/**
 * @brief IRQ36ハードウェア割り込み関数（搬送モーターエンコーダー）
 */
/****************************************************************/
void isr_irq36_proc()
{
}

/****************************************************************/
/**
 * @brief IRQ37ハードウェア割り込み関数（収納モーターエンコーダー）
 */
/****************************************************************/
void isr_irq37_proc()
{
}

/****************************************************************/
/**
 * @brief IRQ38ハードウェア割り込み関数（予約(PBモーターエンコーダー)）
 */
/****************************************************************/
void isr_irq38_proc()
{
}



/* End of file */

