/****************************************************************************/
/*                                                                          */
/*                                                                          */
/*  COPYRIGHT (C) Japan Cash Machine Co.,Ltd. 2010                          */
/*  ALL RIGHTS RESERVED                                                     */
/*                                                                          */
/****************************************************************************/
/*                                                                          */
/* This software contains proprietary, trade secret information and is      */
/* the property of Japan Cash Machine. This software and the information    */
/* contained therein may not be disclosed, used, transferred or             */
/* copied in whole or in part without the express, prior written            */
/* consent of Japan Cash Machine.                                           */
/*                                                                          */
/****************************************************************************/
/****************************************************************************/
/*                                                                          */
/* 本ソフトウェアに含まれるソースコードには日本金銭機械株式会社固有の       */
/* 企業機密情報含んでいます。                                               */
/* 秘密保持契約無しにソフトウェアとそこに含まれる情報の全体もしくは一部を   */
/* 公開も複製も行いません。                                                 */
/*                                                                          */
/****************************************************************************/
/****************************************************************************/
/**
 * @file led_ctrl.c
 * @brief ＬＥＤ制御関数
 * @date 2018.03.05 Created
 */
/****************************************************************************/
#include "systemdef.h"

#define EXT
#include "com_ram.c"
#include "usb_ram.c"
#include "jsl_ram.c"

#include "led_ctrl.h"

/**** VARIABLE DEFINES ******************************************************/
u32 _cyc_led_ctrl_seq = 0;

/****************************************************************/
/**
 * @brief ＬＥＤ制御
 */
/****************************************************************/
void set_led_flik(u32 led_no)
{
	loc_cpu();									/* 割り込み禁止 */
	
	_cyc_led_ctrl_seq = 1;						/* seq = 1 */

	unl_cpu();									/* 割り込み許可 */
}

/****************************************************************/
/**
 * @brief ＬＥＤ制御
 */
/****************************************************************/
void set_led_on(u32 led_no)
{
	loc_cpu();									/* 割り込み禁止 */
	
	_cyc_led_ctrl_seq = 1;						/* seq = 1 */

	unl_cpu();									/* 割り込み許可 */
}

/****************************************************************/
/**
 * @brief ＬＥＤ制御
 */
/****************************************************************/
void set_led_off(u32 led_no)
{
	loc_cpu();									/* 割り込み禁止 */

	_cyc_led_ctrl_seq = 1;						/* seq = 1 */

	unl_cpu();									/* 割り込み許可 */
}


/****************************************************************/
/**
 * @brirf ＬＥＤ全消灯
 */
/****************************************************************/
void set_led_all_off(void)
{
	loc_cpu();									/* 割り込み禁止 */
	
	_cyc_led_ctrl_seq = 1;						/* seq = 1 */

	unl_cpu();									/* 割り込み禁止 */
}

/****************************************************************/
/**
 * @brirf フラッシュメモリ書き込み中
 */
/****************************************************************/
void set_led_flash_write_mode(void)
{
	loc_cpu();									/* 割り込み禁止 */
	
	_cyc_led_ctrl_seq = 2;						/* seq = 2 */
	
	unl_cpu();									/* 割り込み禁止 */
}

/* End if file */


